In [57]:
# 모듈 로딩
import pandas as pd
import numpy as np

# 파일 관련 변수들
DIR = '../Data/'
FILE = DIR + 'titanic.csv'

In [58]:
titanicDF = pd.read_csv(FILE)
titanicDF

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [59]:
subDF = titanicDF.loc[:5, ['Age', 'Fare']]
subDF

    Age     Fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500
5   NaN   8.4583

In [60]:
subDF['Value']=10
subDF

    Age     Fare  Value
0  22.0   7.2500     10
1  38.0  71.2833     10
2  26.0   7.9250     10
3  35.0  53.1000     10
4  35.0   8.0500     10
5   NaN   8.4583     10

### apply(함수명, axis=방향/축) 실습

- apply의 axis=0은 열을 뜻함
- 원소/요소에 함수 적용하기
- 입력 : Series의 요소 또는 DataFrame의 Series (즉, 행 또는 열)
 -> axis =0 (행을 나타내는데, 시리즈 전체를 나타내기 위해서는 열의 값이 모두 필요하다고 생각할 것

In [61]:
import numpy as np

# [ 기본 ] axis = 0     =>     row의 컬럼마다 함수 적용 (세로로 죽)
subDF.apply(np.sum)

Age      156.0000
Fare     156.0666
Value     60.0000
dtype: float64

In [62]:
# [ 수정 ] axis = 1     =>     column의 로우마다 함수 적용 (가로로 죽)
subDF.apply(np.sum, axis = 1)

0     39.2500
1    119.2833
2     43.9250
3     98.1000
4     53.0500
5     18.4583
dtype: float64

In [63]:
# 사용자 정의 함수
def addValue(x):
    print(f'[DEBUG]--------- \n{x}')
    return x+x

def addTwoValue(x, y):
    print(f'[DEBUG]--------- \n{x}, {y}')
    return x+y

In [64]:
subDF.apply(addValue)  # axis = 0임 (기본값)

[DEBUG]---------
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
Name: Age, dtype: float64
[DEBUG]---------
0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
5     8.4583
Name: Fare, dtype: float64
[DEBUG]---------
0    10
1    10
2    10
3    10
4    10
5    10
Name: Value, dtype: int64

    Age      Fare  Value
0  44.0   14.5000     20
1  76.0  142.5666     20
2  52.0   15.8500     20
3  70.0  106.2000     20
4  70.0   16.1000     20
5   NaN   16.9166     20

In [65]:
subDF.apply(addValue, axis=1)

[DEBUG]---------
Age      22.00
Fare      7.25
Value    10.00
Name: 0, dtype: float64
[DEBUG]---------
Age      38.0000
Fare     71.2833
Value    10.0000
Name: 1, dtype: float64
[DEBUG]---------
Age      26.000
Fare      7.925
Value    10.000
Name: 2, dtype: float64
[DEBUG]---------
Age      35.0
Fare     53.1
Value    10.0
Name: 3, dtype: float64
[DEBUG]---------
Age      35.00
Fare      8.05
Value    10.00
Name: 4, dtype: float64
[DEBUG]---------
Age          NaN
Fare      8.4583
Value    10.0000
Name: 5, dtype: float64

    Age      Fare  Value
0  44.0   14.5000   20.0
1  76.0  142.5666   20.0
2  52.0   15.8500   20.0
3  70.0  106.2000   20.0
4  70.0   16.1000   20.0
5   NaN   16.9166   20.0

In [66]:
# Series.apply() ---> 원소 단위
subDF['Age'].apply(addValue)

# Series는 axis = 1이 없으니 무의미

[DEBUG]---------
22.0
[DEBUG]---------
38.0
[DEBUG]---------
26.0
[DEBUG]---------
35.0
[DEBUG]---------
35.0
[DEBUG]---------
nan

0    44.0
1    76.0
2    52.0
3    70.0
4    70.0
5     NaN
Name: Age, dtype: float64

In [67]:
# subDF에 있는 값을 x인자로 받고, y인자는 줬음
subDF.apply(addTwoValue, y=2000)

[DEBUG]---------
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
Name: Age, dtype: float64, 2000
[DEBUG]---------
0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
5     8.4583
Name: Fare, dtype: float64, 2000
[DEBUG]---------
0    10
1    10
2    10
3    10
4    10
5    10
Name: Value, dtype: int64, 2000

      Age       Fare  Value
0  2022.0  2007.2500   2010
1  2038.0  2071.2833   2010
2  2026.0  2007.9250   2010
3  2035.0  2053.1000   2010
4  2035.0  2008.0500   2010
5     NaN  2008.4583   2010

In [68]:
# 사용자 정의 함수
def missingValueCheck(sr):
    print(f'[DEBUG]--------- \n{sr}')
    return sr.isnull()

def missingValueSum(sr):
    print(f'[DEBUG]--------- \n{sr}')
    return sr.isnull().sum()

In [69]:
subDF.apply(missingValueCheck)

[DEBUG]---------
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
Name: Age, dtype: float64
[DEBUG]---------
0     7.2500
1    71.2833
2     7.9250
3    53.1000
4     8.0500
5     8.4583
Name: Fare, dtype: float64
[DEBUG]---------
0    10
1    10
2    10
3    10
4    10
5    10
Name: Value, dtype: int64

     Age   Fare  Value
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5   True  False  False

In [70]:
subDF.apply(missingValueSum, axis=1)

[DEBUG]---------
Age      22.00
Fare      7.25
Value    10.00
Name: 0, dtype: float64
[DEBUG]---------
Age      38.0000
Fare     71.2833
Value    10.0000
Name: 1, dtype: float64
[DEBUG]---------
Age      26.000
Fare      7.925
Value    10.000
Name: 2, dtype: float64
[DEBUG]---------
Age      35.0
Fare     53.1
Value    10.0
Name: 3, dtype: float64
[DEBUG]---------
Age      35.00
Fare      8.05
Value    10.00
Name: 4, dtype: float64
[DEBUG]---------
Age          NaN
Fare      8.4583
Value    10.0000
Name: 5, dtype: float64

0    0
1    0
2    0
3    0
4    0
5    1
dtype: int64